{"basics":{"name":"Alex Kimani","label":"I am a young brilliant and dynamic financial professional with a passion for the development of the emerging markets with a specific focus on the Sub Saharan Africa.","profile":"https:\/\/www.linkedin.com\/in\/alexkimani\/"},"work":[{"company":"USAID East Africa Trade and Investment Hub&#44; Nairobi, Kenya","summary":"Investment Analyst","desc":"The East Africa Trade and Investment Hub (EATIH or the Hub) is the U.S. government’s flagship project under the presidential Trade Africa initiative, launched in 2013 to boost trade and investment with and within Africa. \n\nThe Hub’s investment and technology component conducted an analysis to determine high-impact sectors in the East African region. The Hub chose its sectors based on return on investment and alignment to Hub overall objectives, including employment, regional trade, technology acquisition, and gender inclusion. \n\nThe Hub offers transaction support services to eligible investors include private equity funds, commercial banks, impact funds, and development finance institutions. \n\nThe Hub’s transaction team acts as a neutral intermediary to provide: Opportunity validation, Market intelligence, Fundraising support, Due diligence, Deal structuring and Financial analysis and modeling.\n\nI work closely with and support the Director for Investment and ICT in the design and execution of innovative strategies and activities to facilitate and accelerate investment into the EAC through:\n•Identification and engagement with capital markets, investment firms, and financial institutions partners in facilitating investment transactions within agri-business, financial services, ICT and biotechnology. \n•Supporting the transaction advisory unit in identifying innovative ways to structure investments for maximum social impact.\n•Designing and implementing programs that support the development of linkages with private sector partners in the region e.g. producers, traders and associations that could act as investment catalysts.\n•Carrying out the review of pipeline transaction and perform initial due diligence for sourced transactions.\n•Supporting EATIH in the identification of potential partners and firms that are likely to invest along the priority value chains identified.\n•Identifying, designing and attending regional trade and investment promotion events.","startDate":"Nov 2015 ","endDate":" Present "},{"company":"Equity Bank Limited&#44; Nairobi, Kenya","summary":"Analyst, Corporate &amp; SME Banking","desc":"I was responsible for analyzing credit data and financial reports to determine risk involved in loaning money or extending credit to SMEs &amp; corporate clients. My role was primarily geared towards ensuring that the bank maintains a healthy portfolio while still meeting the Bank&#39;s growth and profitability goals through:\n• Conducting comprehensive business and organizational analysis to form a deep, broad, accurate and up-to-date understanding of a borrowing business’s health, capacity and capability to appropriately utilize and fully repay its loan in a timely manner.  \n• Assisting the lending staff in protecting the Bank’s assets by providing the necessary analysis to facilitate the lending staff to make sound credit decisions so as to balance customers’ needs with the Bank’s risk profile, growth and earnings goals.\n• Assisting the lending staff in maintenance and development of key channel relationships.\n• Training, counseling, advising, and communicating credit department policy and procedures to bank lending staff.\n","startDate":"Jan 2015 ","endDate":"Nov 2015"},{"company":"Equity Consulting Group Limited&#44; Nairobi, Kenya","summary":"Business Analyst","desc":"Equity Consulting Group (now wound up) was wholly owned subsidiary of Equity Bank Group Limited, specialized in the provision of a wide range of Business Advisory Services in Strategic Planning, Corporate Governance, Operations Management, Production Management and Work Flow, Sales Methodologies, Marketing Strategies and Methodologies, Human Resource Management, Financial Structuring \/ Modelling and Valuation, Gearing among others. ECG had an experienced and internationally diverse team that delivers customised high impact and value-adding management consulting services. ECG worked with organisations keen to boost their operational, financial and service delivery performances by developing business strategies and aligning business operations.\nAt ECG, I supported our clients in financial management in areas such as financial statement analysis, financial diagnosis and planning, accounting, reporting, forecasting, cost-benefit analysis and risk management.\nMy roles and responsibilities included but are not limited to:\na. Identifying specific client problems and develop appropriate and effective solutions and recommendations for the client organizations, with extensive client consultation.\nb. Undertaking research, analyzing and interpreting data and statistics to deepen understanding of various industries, markets and competitors, and business issues.\nc.Identifying and assessing the pros and cons of possible alternative strategies, providing cost\/benefit analysis, and laying out clear processes and steps to achieve the outcomes\nd. Presenting material to clients through a variety of modes of communication (e.g., verbally, visually\/pictorial and in writing) and to clients with varying levels of sophistication, particularly on business management concepts.","startDate":"Jun 2014 ","endDate":"Dec 2014"},{"company":"Industrial Promotion Services (K) Limited&#44; Nairobi Kenya","summary":"Corporate and Project Financial Analyst","desc":"The Industrial Promotion Services (Kenya) Limited is a private equity fund established by the Aga Khan Fund for Economic Development (AKFED) to provide venture capital, technical assistance and management support to encourage and expand private enterprise. As a Financial Analyst at IPS (Kenya) Ltd, I provided management and technical support to companies within the IPS group through assignments relating to:\na.\tInvestment appraisals through the analysis of historical and projected financial statements,                       creation of financial models and conduct of industry and market research.\nb.\tMonitoring existing investments in portfolio companies by reviewing company performance and preparing internal reports based on periodic financial statements, project progress reports, and other information submitted by portfolio companies.\nc.\tGroup financial reporting for statutory, internal and external purposes.\nd.\tBusiness and capital planning\/ budgeting.\ne.\tBusiness valuations.","startDate":"Feb 2010 ","endDate":"May 2014"},{"company":"Insurance Regulatory Authority&#44; Nairobi, Kenya","summary":"Intern - Actuarial &amp; Compliance","desc":"The Insurance Regulatory Authority is a statutory government agency established under the Insurance Act (Amendment) 2006, CAP 487  of the Laws of Kenya to regulate, supervise and develop the insurance industry. \nAs an intern in the Actuarial Department my main roles included but were not limited to:\na.\tCarrying out periodic analysis on the adequacy of technical provisions (UPR, IBNR and Outstanding Claims) and the manual of premium rates for industry general insurance business.\nb.\tReviewing and validating actuarial valuation reports and actuarial parameters for industry life insurance business in line with statutory valuation assumptions. \nc.\tReviewing applications for new insurance product and license issuance at registration or renewal for players or authorization for changes in business structure (mergers, splits or acquisitions).","startDate":"Jun 2009 ","endDate":"Aug 2009"}],"education":[{"institution":"CFA Institute","studyType":"Level II candidate&#44; Finance &amp; Investment","startDate":"2013 ","endDate":"2017"},{"institution":"Heriot-Watt University","studyType":"MBA&#44; Finance","startDate":"2012 ","endDate":"2014"},{"institution":"Maseno University","studyType":"B.Sc&#44; Actuarial Science","startDate":"2005 ","endDate":"2009"},{"institution":"Strathmore University","studyType":"Associate (Higher Diploma)&#44; Institute for the Management of information Systems (IMIS)","startDate":"2004 ","endDate":"2005"},{"institution":"Alliance High School","studyType":"Kenya Certificate of Secondary Education&#44; O Levels","startDate":"2000 ","endDate":"2003"}],"skills":["Financial Analysis","Financial Modeling","Sensitivity Analysis","Project Finance","Research","Statistical Computing","Portfolio Management","Investments","Excel","Strategic Planning","Microsoft Excel","Managerial Finance","Finance","Management","Analysis","Strategy","Budgets","Economics","Internal Audit","Accounting","Financial Reporting","Risk Management","Market Research"],"category":{"Law\/Tax":{"point":1,"skills":[[{"work_pos":{"company":"USAID East Africa Trade and Investment Hub, Nairobi, Kenya","summary":"Investment Analyst"},"point":1}]]},"Travel Transportation":{"point":1,"skills":[[{"work_pos":{"company":"USAID East Africa Trade and Investment Hub, Nairobi, Kenya","summary":"Investment Analyst"},"point":1}],[{"work_pos":{"company":"USAID East Africa Trade and Investment Hub, Nairobi, Kenya","summary":"Investment Analyst"},"point":1},{"work_pos":{"company":"Equity Bank Limited, Nairobi, Kenya","summary":"Analyst, Corporate & SME Banking"},"point":1}]]},"Places":{"point":1,"skills":[[{"work_pos":{"company":"USAID East Africa Trade and Investment Hub, Nairobi, Kenya","summary":"Investment Analyst"},"point":1}],[{"work_pos":{"company":"USAID East Africa Trade and Investment Hub, Nairobi, Kenya","summary":"Investment Analyst"},"point":1},{"work_pos":{"company":"Equity Bank Limited, Nairobi, Kenya","summary":"Analyst, Corporate & SME Banking"},"point":1}],[{"work_pos":{"company":"USAID East Africa Trade and Investment Hub, Nairobi, Kenya","summary":"Investment Analyst"},"point":1},{"work_pos":{"company":"Equity Bank Limited, Nairobi, Kenya","summary":"Analyst, Corporate & SME Banking"},"point":1},{"work_pos":{"company":"Equity Consulting Group Limited, Nairobi, Kenya","summary":"Business Analyst"},"point":1}],[{"work_pos":{"company":"USAID East Africa Trade and Investment Hub, Nairobi, Kenya","summary":"Investment Analyst"},"point":1},{"work_pos":{"company":"Equity Bank Limited, Nairobi, Kenya","summary":"Analyst, Corporate & SME Banking"},"point":1},{"work_pos":{"company":"Equity Consulting Group Limited, Nairobi, Kenya","summary":"Business Analyst"},"point":1},{"work_pos":{"company":"Industrial Promotion Services (K) Limited, Nairobi Kenya","summary":"Corporate and Project Financial Analyst"},"point":1}]]}}}