{"basics":{"name":"Amara Senerath","label":"","profile":"https:\/\/www.linkedin.com\/in\/amarasenerath\/"},"work":[{"company":"Dell EMC&#44; Melbourne, Australia","summary":"Account Systems Engineer","desc":"Commercial - Victoria","startDate":"Sep 2017 ","endDate":" Present "},{"company":"Hewlett Packard Enterprise&#44; Melbourne &amp; Sydney, Australia","summary":"Solutions Consultant","desc":"Develop the Winning Solution Strategy \nDevelop solution strategy by understanding the rationale behind business and technical requirements to make a positive difference. Facilitate strategy workshops to get different views using an inclusive approach so, that everyone is heard and appreciated.\n\nExcel in Ambiguity and Change\nCapable of efficiently convert ambiguity to a further engagement and the changes to an opportunity increase scope, take ownership to decide and act without having the total picture, comfortably handle risk and uncertainty by carefully working through a risk response strategy to mitigate the risks.\n\nDesign Outcome Driven Solutions \nAssess complex problems quickly and generate a variety of alternative courses of action and select the most appropriate solution and consult until the realisation of the outcomes.\n\nFinancial and Commercial Solution Development and Optimisation\nAccurately estimate project and ongoing costs, optimise Payback Period, NPV and FFR(first fiscal year revenue) and overall engagement margin position and quantify risk response. \n\nConvince, Negotiate and Cultivate Trust\nProduce and deliver presentations to both technical and business audiences to improve confidence and continuously deliver, what is being promised to earn respect and trust. Advocate and negotiate on solution scope, shape requirements with the customer, perform due diligence to achieve business outcomes for the client and gain a competitive advantage against competition by being an advocate. Produce SOWs, Service Descriptions, RACIs, Transition and Transformation Documents to help customers to go through business case approvals.\n\nCompete and Win Respectfully \nArticulate the importance of our thinking and decision flow so; customer understands why we decided to execute this way for them. Win new business by reasoning out why we think and believe, it is the best solution so, that customers can achieve their business outcomes on-time, on budget and with fewer risks. ","startDate":"Apr 2016 ","endDate":"Jun 2017"},{"company":"HP&#44; Melbourne, Australia","summary":"Pre-Sales Consultant - Private Cloud, Storage &amp; Backup","desc":"•\tBe a catalyst to influence the solution strategy by understanding the rationale behind     business or technical requirements to make a positive difference \n\n•\tCapable of effectively cope with change, decide and act without having the total picture, comfortably handle risk and uncertainty\n\n•\tAbility to assess complex problems quickly and generate a variety of alternative courses of action and select the most appropriate  \n\n•\tArchitect and scope complex enterprise wide storage and backup solutions which span across Asia Pacific Region and worldwide using heterogeneous storage and backup products (HP, IBM, EMC, Netapp, Symantec etc.)\n\n•\tAccurately estimate cost, produce SOWs, Service Descriptions, Transition and Transformation Documents\n\n•\tProduce and deliver presentations to both technical and business audiences\n\n•\tNegotiate solution aspects, perform Due Diligence, Compete &amp; win new business by reasoning out the outcomes that matters to the customer","startDate":"Sep 2010 ","endDate":"Mar 2016"},{"company":"IBM","summary":"Pre-Sales IT Specialist - Server, Storage &amp; Data Services","desc":"•\tAnalyze customer requirements, write proposals, deliver presentations, negotiate &amp; win new business against competition.\n•\tSolution design &amp; implement on IBM Power Systems, Server &amp; Storage Virtualization including IBM SVC, BladeCenter, IBM Softek, Global, Metro &amp; Enhanced Remote Mirroring technologies.  \n•\tAnalyze system performance, identify system bottlenecks &amp; suggest remedies using TPC for Disk &amp; native tools of IBM SVC, IBM Storage &amp; SAN Technologies\n•\tSAN solution design, implementation &amp; maintenance including LSAN (Logical SAN) &amp;  FCIP Tunnelling using IBM b type switches and multi protocol  routers\n•\tProduce design documents which describes architecture, scope of work, deliverables &amp; acceptance procedures\n•\tBreak down  solutions into a sequence of tasks with realistic milestones, compile responsibility matrix, develop effort estimation &amp; cost cases\n•\tImplement proof of concepts on new technologies such as Thin Provisioning, vdisk mirror, IBM Softek &amp; data replication solutions\n•\tParticipate in project review meetings to discuss &amp; identify project deliverables, dependencies, deadlines, plan, schedule &amp; resources.\n•\tOver see project risks &amp; suggest alternate strategies to overcome time &amp; resource challenges","startDate":"Jan 2009 ","endDate":"May 2010"},{"company":"IBM","summary":"Customer Engineer – System X, Storage &amp; TSM","desc":"•\tImplement, maintain &amp;amp; troubleshoot IBM SAN Disk - DS4000, DS5000, DS8000 and DS8300 solutions which includes install, cable, configure, integrate, perform preventive maintenance &amp;amp; firmware upgrades\n•\tAdvance storage troubleshooting experience such as Ghost Drive Removal, `WriteZerosFlag` manipulation for data recovery and SVC T3 recovery. \n•\tImplement, maintain &amp;amp; troubleshoot IBM SVC (San Volume Controller) solutions consist of GlobalMirror remote replication with disaster recovery, space efficient flashcopy &amp;amp; remote mirror technologies.\n•\tIBM SVC Hardware installation, host\/storage configuration, multipath\/operating system integration &amp;amp; operational tasks automation with SSH scripts.\n•\tPerform fabric OS upgrades, create aliases, physical &amp;amp; logical zones (LSAN) &amp;amp; FCIP tunnels.\n•\tImplement, maintain &amp;amp; troubleshoot \n    o\tIBM System X, P and BladeCenter based solutions.\n    o\tUnix, AIX, RedHat, Windows Operating Systems &amp;amp; Cluster Solutions\n    o\tIBM Tivoli Storage Manager based backup solutions.\n•\tPrepare user manuals conduct administrative training for customers on operational activities","startDate":"Apr 2007 ","endDate":"Dec 2008"}],"education":[{"institution":"University of Ruhuna","studyType":"Bachelor of Science&#44; Electrical &amp; Information Engineering","startDate":"2003 ","endDate":"2007"}],"skills":["Storage","Disaster Recovery","SAN","HP","Pre-sales","Solution Architecture","AIX","Cluster","Linux","Cloud Computing","Windows","Virtualization","Integration","Outsourcing","TSM","Enterprise Storage","IT Operations","Enterprise Software","IT Service Management","IT Outsourcing","VMware","Unix","ITIL","Data Center","Architecture","High Availability","NetApp","Switches","Backup Solutions","DS4000","Operating Systems","Enterprise Architecture","Solaris","Routers","Managed Services","Infrastructure","Troubleshooting","Storage Virtualization","Replication","Servers","Unix Shell Scripting","Solution Design","Storage Area Networks","Shell Scripting","SQL","Consultancy","Clustering","Competitive Analysis","Portfolio Management","Information Architecture"],"category":{"Technology":{"point":3,"skills":[[{"work_pos":{"company":"Dell EMC, Melbourne, Australia","summary":"Account Systems Engineer"},"point":3}],[{"work_pos":{"company":"Dell EMC, Melbourne, Australia","summary":"Account Systems Engineer"},"point":3},{"work_pos":{"company":"IBM","summary":"Pre-Sales IT Specialist - Server, Storage & Data Services"},"point":3}],[{"work_pos":{"company":"Dell EMC, Melbourne, Australia","summary":"Account Systems Engineer"},"point":3},{"work_pos":{"company":"IBM","summary":"Pre-Sales IT Specialist - Server, Storage & Data Services"},"point":3},{"work_pos":{"institution":"University of Ruhuna","studyType":"Bachelor of Science, Electrical & Information Engineering"},"point":3}]]},"Travel Transportation":{"point":4,"skills":[[{"work_pos":{"company":"Hewlett Packard Enterprise, Melbourne & Sydney, Australia","summary":"Solutions Consultant"},"point":4}]]},"Places":{"point":4,"skills":[[{"work_pos":{"company":"Hewlett Packard Enterprise, Melbourne & Sydney, Australia","summary":"Solutions Consultant"},"point":4}]]}}}