{"basics":{"name":"Anh Huynh Trieu","label":"If you have interest in making a career move or just a career advice, please send your CV to anh.huynh@monroeconsulting.vn or contact me for more details:\n(Mobile) 0903 314 521\n(Skype) mars_huynh\n\nThank you and best regards,\nHuynh Trieu Anh (Mr.)","profile":"https:\/\/www.linkedin.com\/in\/anh-huynh-trieu-2185a588\/"},"work":[{"company":"Monroe Consulting Group, Asia&#44; Vietnam","summary":"Senior Executive Recruitment Consulting, Technology, VN","desc":"Monroe Consulting Group is an international award-winning executive recruitment company that delivers the highest standards of professionalism to multinational and national companies in emerging economies around the world. Originally conceived in Australia, the Group opened its first office in Thailand in 2002 and expanded rapidly. It now operates a network of branches throughout Asia and Latin America, employing more than 100 professional consultants who are expert at recruiting in developing markets.\n\nMonroe Consulting Group provides a selection of recruitment services that can be tailored to the specific requirements of its customers in a range of contexts. Clients can opt for either a database search or an executive search (headhunting) recruitment service, both of which are offered on success-based fee structures. It is Monroe’s ability to talent map, locate and recruit the finest candidates for its clients that sets the Company apart from its competitors.\n\nWith a proven track record of success in dynamic and challenging environments across Asia and Latin America, Monroe Consulting Group has become a committed advocate to an increasing number of respected multinational and national corporations operating in emerging markets today. Monroe’s local knowledge and its international networks mean that wherever you operate, the Company offers clients the assurance that comes from working with a professional executive recruitment company.","startDate":"Oct 2017 ","endDate":" Present "},{"company":"Getlinks Inc&#44; Vietnam","summary":"Senior Recruiter","desc":"Getlinks is a curated tech hiring marketplace for Asia – connecting  developers, designers, digital marketers and tech talents with the best jobs. With aim to help 25M quality tech talents to break into their dream jobs, Getlinks puts a high vetting process to ensure quality candidates and jobs on both sides.\nWith just over a year since birth, Getlinks proudly organized over 15 offline events across Thailand, Vietnam, and Singapore which oversees 25,000 total participants. With the recent seed backing by 500 Startups &amp; CyberAgent Ventures, we are rapidly expanding across SEA - including Singapore, Vietnam, Indonesia, Hong Kong and Philippines.\nGetlinks is well on the way to disrupting tech recruiting in Asia, empowering elite tech talents to connect with like-minded teams across borders more efficiently and making impact pushing the digital economy forward.","startDate":"Sep 2016 ","endDate":"Sep 2017"},{"company":"Talentnet Corporation","summary":"Senior Consultant","desc":"Being one of the first local HR companies laying the foundations for Vietnam’s fledgling HR industry, with nearly 20 working years of experience in Vietnam labour market, Talentnet is the only HR consulting firm providing the total HR solutions for all HR aspects. We are now serving for more than 1,000 clients including multi-national, joint ventures, joint stock companies and prestigious local brand, which 50% of are from Fortune 500. We assist clients in Executive Search and Selection, Payroll and HR Outsourcing, Mercer Salary Surveys and HR Consulting.\nWhat makes us different?\n•\tThe longest established executive search service in Vietnam specializing in middle management level up\n•\tLarge database of over 70,000 managerial up candidates including expatriate\n•\tHigh-standard executive searching provided with a sincere care thanks to the insightful understanding about labor market\nEndorsement from candidates and clients:\n•\tLarge pool of senior candidates\n•\tStrong network with top companies\n•\tTime commitment\n•\tDeep market insight\n•\tAdvisory skill\n•\tHigh quality\nCovering the whole labor market, Talentnet’s Executive Search Service delivers a particular focus on the various industries\/function.","startDate":"Jan 2016 ","endDate":"Aug 2016"},{"company":"Talentnet Corporation&#44; Ho Chi Minh City","summary":"Consultant","desc":"In charge of Hi-tech Client and candidates","startDate":"Nov 2014 ","endDate":"Dec 2015"},{"company":"RGF HR Agent Viet Nam","summary":"Career Consultant","desc":"In charge of Japanese clients and candidates","startDate":"Apr 2014 ","endDate":"Oct 2014"},{"company":"Robert Bosch Viet Nam&#44; Dong Nai Province","summary":"Recruiter","desc":"•\tRecruit operators and interns for departments\n•\tSupport the personnel marketing activities (job fair, marketing projects)\n•\tLearn the best ways to communicate and work with people","startDate":"Oct 2013 ","endDate":"Apr 2014"},{"company":"Robert Bosch Viet Nam","summary":"Training and Development Intern","desc":"•\tSupport the training organization (review the list of participants, prepare \n•\ttraining tools, distribution of training materials, book the training room, follow up the attendance)\n•\tUpdate the training database (input data, record training)","startDate":"May 2013 ","endDate":"Oct 2013"},{"company":"Foreign Trade University - Youth Union","summary":"Head of Organizing &amp; Building Board","desc":"•\tPlan and organize many events such as My.Saigon, FTU Traditional Festival Day, Development programs for Young Union officers, recruitment program for Youth Union\n•\tIn the events, my favorite position is in the Logistics Department where my task is to plan and to ensure that we provide completely supplies","startDate":"Jul 2012 ","endDate":"Mar 2013"}],"education":[{"institution":"Foreign Trade University","studyType":"Bachelor&#39;s degree&#44; External Economics","startDate":"2009 ","endDate":"2013"}],"skills":["Talent Management","Recruiting","HR Consulting","Employee Relations","Human Resources","Screening","Interviews","Internet Recruiting","Screening Resumes","Contract Recruitment","Recruitments","Hiring","Team Building","Deferred Compensation","Time Management","Teamwork","Management","Microsoft Office","Training","Executive Search"],"category":{"Technology":{"point":2,"skills":[{"skill":"Microsoft Office","point":2}]},"Law\/Tax":{"point":3,"skills":[{"skill":"Contract Recruitment","point":3}]},"Travel Transportation":{"point":3,"skills":[[{"work_pos":{"company":"RGF HR Agent Viet Nam","summary":"Career Consultant"},"point":3}],{"skill":"Teamwork","point":3}]},"Places":{"point":4,"skills":[[{"work_pos":{"company":"RGF HR Agent Viet Nam","summary":"Career Consultant"},"point":4}],{"skill":"Teamwork","point":3}]}}}