{"basics":{"name":"Chaula Ganatra","label":"Chaula Ganatra joined CompuLynx in 2003. The 12 years since then have seen her rise up the ranks and notch up miles of impressive and meaningful experience and increased expertise. \n\nAs Head of Identity Management, Fraud and Loss Prevention practice, she’s a critical spearhead of CompuLynx’s expansion into the rest of Africa on the practice Identity Management, Fraud and Loss Prevention. “Heading that practice across Africa means a huge task of ensuring that all verticals under these this is covered,” she says. The client list includes those in the NGOs (especially the UN), Education, Banking and Government.\n\nChaula joined CompuLynx as Research Assistant and moved to the Smart Card business as Business Development Executive before rising to Business Development Manager. A focused and practical-minded visionary. Chaula grew to become Senior Development Manager then Head of Sales Africa. Clear about what she wants, she took a sabbatical for family reasons. It is well-documented all across the world that a big frustration for women in the job market is that they have to manage family and career. However, evidence of just how much CompuLynx valued Chaula’s contribution was that she rejoined as Head of Strategy, now fully focused on Identity Management, Fraud and Loss Prevention.\n\nChaula takes pride in being the one who infuses African culture into CompuLynx’s sophisticated work machinery. “My work is to put forward the best image of CompuLynx as a Kenyan company,” she says. Her responsibilities include the initiation and coordination of action plans to penetrate new markets, performance and development of Identity Management Solutions, Customer Relations Management and facilitation of communication between CompuLynx’s workers, customers and suppliers.\n","profile":"https:\/\/www.linkedin.com\/in\/chaula-ganatra-b54b451a\/"},"work":[{"company":"CompuLynx Ltd.&#44; Centre Point ,Parklands","summary":"Head of Strategy - Africa","desc":"Determines annual unit and gross-profit plans by implementing marketing strategies; analyzing trends and results.\n\nEstablishes sales objectives by forecasting and developing annual sales quotas for regions and territories; projecting expected sales volume and profit for existing and new products.\n\nImplements national sales programs by developing field sales action plans.\n\nMaintains sales volume, product mix, and selling price by keeping current with supply and demand, changing trends, economic indicators, and competitors.\n\nEstablishes and adjusts selling prices by monitoring costs, competition, and supply and demand.\n\nCompletes national sales operational requirements by scheduling and assigning employees; following up on work results.\n\nMaintains national sales staff by recruiting, selecting, orienting, and training employees.\n\nMaintains national sales staff job results by counseling and disciplining employees; planning, \nmonitoring, and appraising job results.\n\nMaintains professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; participating in professional societies.\n\nContributes to team effort by accomplishing related results as needed.\n","startDate":"Jan 2015 ","endDate":" Present "},{"company":"CompuLynx Ltd.","summary":"Head of Strategy","desc":"Planning, Analyzing, Evaluating\n\nDevelop workable budgets, work plans and realistic timetables.\n\nCollaborates with the Account Supervisor or Manager, Client Services, on preparation of marketing recommendations, strategies and actions for the client.\n\nReviews, analyzes and evaluates the following, relative to the client’s needs and objectives: media output, creative output, research reports and client data.\n\nDefining project scope, estimate and writing proposals, works with producer in the creation of project specifications and time plans.\n\nIdentify and develop target list of clients and partners\n\nUnderstand business objectives, challenges and opportunities of target and industry\n\nResponsible for departmental vision, structure, and management while providing leadership, accountability, and mentorship to brand strategy.\n\nDevelop in collaboration with the The agency team, innovative and \/ or differentiating products and services \n\nTeam Leading, Coordinating, Managing\n\nBe the agency’s lead brand evangelist, embodying Impact’s core values and differentiating perspectives\n\nIdentify the right opportunities across industry sectors and media that align with the agency’s ongoing strategy\n \nMaintain and develop prospective client and key strategic partners network\n\nDevelop integrated marketing strategies and tactical plans to meet and exceed the client’s marketing and business goals and objectives\n\nGenerate and drive insight for internal and client audiences around media, brands, consumers, and experiences\n\nRepresent the agency at conferences, events and symposiums\n\nProvide market research, analyses and insights into latest industry trends\n\nPosition Impact with key industry influencers and though leaders\n\nLead and manage new business presentations as assigned\n\nGrow and develop existing client accounts.\n\nMonitoring and enforcing new business risk and constraints (schedule \/ scope \/ resources)\n","startDate":"2003 ","endDate":"2015"}],"education":[{"institution":"St. Xavier&#39;s College","studyType":"Master&#39;s degree&#44; Economics","startDate":"","endDate":""},{"institution":"St. Xaviers - Gandhinagar","studyType":"M.Com&#44; Economics, Statistics, Accounts","startDate":"","endDate":""}],"skills":["Business Strategy","Business Analysis","Team Management","Project Management","Strategic Planning","Team Leadership","Business Development","NGO","Identity Management","Banking","Fraud Prevention","IT Solutions","Customer Satisfaction","Public Speaking","Healthcare Information Technology","Government","New Business Development","Sales Management","Strategy","Pre-sales","Business Intelligence","CRM","Solution Selling","Smart Cards","Cloud Computing","Management","Account Management","Partner Management","Vendor Management","Outsourcing","Software Project Management","Payment Systems","Customer Relationship Management (CRM)"],"category":{"Technology":{"point":1,"skills":[{"skill":"IT Solutions","point":1},{"skill":"Healthcare Information Technology","point":1},{"skill":"Software Project Management","point":1}]},"Law\/Tax":{"point":1,"skills":[[{"work_pos":{"institution":"St. Xaviers - Gandhinagar","studyType":"M.Com, Economics, Statistics, Accounts"},"point":1}],{"skill":"Account Management","point":1}]},"Health":{"point":1,"skills":[{"skill":"Healthcare Information Technology","point":1}]},"Travel Transportation":{"point":2,"skills":[[{"work_pos":{"company":"CompuLynx Ltd., Centre Point ,Parklands","summary":"Head of Strategy - Africa"},"point":2}]]},"Places":{"point":2,"skills":[[{"work_pos":{"company":"CompuLynx Ltd., Centre Point ,Parklands","summary":"Head of Strategy - Africa"},"point":2}]]}}}