{"basics":{"name":"Bilha Wandia","label":"Over 8 years extensive technical and product experience in Motor Vehicle and FMCG Multinational Industries in areas of data analysis, system configuration, modification and other functions for maximizing productivity and visibility. Expert in implementing solutions and applications, driving new ideas, projects and trainings. Formulating solutions and reports to help decision makers identify and resolve business issues while at the same time making future business strategies. A high performer having excellent communication, inter-personal and people skills. Ability to learn and use new systems and paradigms in considerably less time.","profile":"https:\/\/www.linkedin.com\/in\/dbilha\/"},"work":[{"company":"Wrigley&#44; Nairobi","summary":"Sales Systems Specialist - East Africa","desc":"* East Africa Region systems specialist and power user whilst consulting with Ghana, Nigeria and Dubai power users\n* Work closely and bottom-up with the sales force for information needs understanding and KPIs progress tracking\n* Leading the build and management of a reliable field database in East Africa for high efficiency, product visibility and data quality &amp; integrity\n* Development, management and maintenance of Mobile Help Pages communication platform for East Africa field force\n* Implementation and  management of Sales Systems and ERP systems for analytical reports and KPI tracking \n* Work closely with the sales force and developers and other end users as the Business Partner-Systems thus ensure technical compartibility and user satisfaction\n* Ensure that budgets are adhered to and deadlines met\n* Creation and maintenance of system configurations, mirrored and shared to Ghana and Nigeria Power Users\n* Creation and maintainance of routes for the daily plan for Kenya as part of Route To Market strategy\n* Manage and cordinating collection of GPS codes and leading the project to route all Wrigley outlets in Kenya, Uganda and Tanzania\n* Function as the Business Partner-Systems for the sales team requirements for the East Africa field force, Distributors and Enterprenuer teams\n* Lead in all software testing as required by the Regional and Global Center of Excellence (CoE) teams\n* Manage data quality while continuously monitoring system performance and sales force KPIs achievement\n* Training of all East African field force in regard to the systems operations, new enhancement, correct data capture and how it feeds to their key performance indicators\n* Tracking of new product launches for analytics and ditribution – net numeric and weighted","startDate":"Apr 2012 ","endDate":" Present "},{"company":"Wrigley&#44; Nairobi","summary":"Sales Systems Specialist for East Africa","desc":"","startDate":"Apr 2012 ","endDate":" Present "},{"company":"Toyota Kenya Limited&#44; Nairobi","summary":"Sales Planning Administrator","desc":"* Administrate the SAP DBM in reference to Stock Management, BW reporting and customer database maintenance and optimization\n* Data analysis and forecasting to determine production orders to match demand\n* Stock Analysis and management to meet demand and orders in place, aged stocks and monthly stock-take reports\n* Built consensus in stock ordering, resolves emerging issues on availability and devise solution for sales, operations and logistics.\n* Facilitate training programs and knowledge share forums on product change and\/or refresher sessions including departmental heads training on the Sales &amp; Stock Order Rundown Process for increased ordering accuracy.\n* Actively participate and chair in Stock Sales and Order Process meeting for consensus building with the Sales department’s heads on a monthly basis.\n* Facilitate budget formulation, implementation and review\n* Reporting both internally and externally to shareholders and all stakeholders, stock reconciliations, product reviews and market analysis\n* Actively participate and a committee member of EHS-Environmental Health &amp; Safety-to ensure\nadherence to the stated policies and procedures relating to health, safety and quality management\n* Demo vehicles management and reporting\n* Preparation of the Sales Customer Service Index (CSI)\n","startDate":"Jun 2008 ","endDate":"Apr 2012"}],"education":[{"institution":"London Metropolitan University","studyType":"Bachelor of Science (BSc)&#44; Computing Information Systems","startDate":"","endDate":""}],"skills":["Business Process Improvement","Process Improvement","Business Analysis","Sales Operations","Product Development","New System Development","Information Security","Training &amp; Development","ERP","SAP ERP","FMCG","Brand Awareness","Trade Marketing","Sales Presentations","Presentation Skills","Teamwork","Customer Service","Event Planning","Microsoft Office","SAP","People Skills","Technical Support","Business Intelligence","Analytics","Sales","Analysis","Marketing","Training","Management","Negotiation","Strategic Planning","Budgets","Business Planning","New Business Development","Market Research","Team Leadership","Technical Leadership"],"category":{"Technology":{"point":1,"skills":[[{"work_pos":{"company":"Wrigley, Nairobi","summary":"Sales Systems Specialist - East Africa"},"point":1}]]},"Car Motor":{"point":2,"skills":[[{"work_pos":{"company":"Toyota Kenya Limited, Nairobi","summary":"Sales Planning Administrator"},"point":2}]]},"Travel Transportation":{"point":2,"skills":[[{"work_pos":{"company":"Wrigley, Nairobi","summary":"Sales Systems Specialist - East Africa"},"point":1}],[{"work_pos":{"company":"Wrigley, Nairobi","summary":"Sales Systems Specialist - East Africa"},"point":1},{"work_pos":{"company":"Toyota Kenya Limited, Nairobi","summary":"Sales Planning Administrator"},"point":2}]]},"Places":{"point":2,"skills":[[{"work_pos":{"company":"Wrigley, Nairobi","summary":"Sales Systems Specialist - East Africa"},"point":2}],[{"work_pos":{"company":"Wrigley, Nairobi","summary":"Sales Systems Specialist - East Africa"},"point":2},{"work_pos":{"company":"Toyota Kenya Limited, Nairobi","summary":"Sales Planning Administrator"},"point":2}]]}}}