{"basics":{"name":"diana cheserem","label":"","profile":"https:\/\/www.linkedin.com\/in\/diana-cheserem-92182827\/"},"work":[{"company":"MiDCOM Group&#44; Nairobi , Kenya","summary":"Assistant Trade Marketing Manager","desc":"Responsibilities \n-\tDevelopment and execution of quarterly marketing plans in conjunction with the sales department\n-\tIn charge of all below the line activities both for the GT and MT channels which include, sampling promotions, push promotions and reward mechanisms for retailers and wholesalers. \n-\tMarket research to determine market requirements for existing and future products\n-\tSpearheading all PR and communication activities for the brand \n-\tOversee the preparation of publicity brochures, handouts, promotional videos and multimedia programs that serve to promote the brand during campaigns.\n-\tManagement of quarterly budgets to ensure that all marketing efforts are executed within budget without compromising on quality and delivery of services.\n-\tWorking closely with marketing suppliers to ensure that quality work is provided at affordable costs \n-\tWorking closely with the customers to ensure that the Lato brand is well propagated, through negotiating of share of shelf, taking advantage of instore branding, use of POS materials and branded FSUs. I also ensure that the ideal planograms for retail shops both in the MT and GT are adhered to by the respective merchandisers. \n-\tManaging launch campaigns for the launch of new SKU’s and new dairy products into the appropriate markets.\n-\tEvaluation of advertising and promotional to ensure compatibility with the target audience \n-\tBuilding consumer insights for Lato Milk so as to understand the needs of the both the consumer and the customers in the supply chain network.\n-\tTo use sales forecasting and strategic planning, analyzing business development, monitoring market trends to ensure the sale and profitability of the marketing efforts geared towards converting more consumers to the Lato brand. \n-\tManagement of BTL activities including radio activations, sourcing of ideal sites for billboard, street poles, wall branding and shop signages \n-\tManagement of ATL campaigns. \n\n","startDate":"Aug 2016 ","endDate":" Present "},{"company":"Farmer&#39;s Choice Limited&#44; Nairobi, Kenya","summary":"Marketing Assistant","desc":"Marketing Assistant                                                                                                           \nMy responsibilities at the company were as follows: \n-\tProvide direction to all aspects of marketing and branding at Farmer’s Choice Ltd. \n-\tPreparation of reports to management on sales promotions and market surveys conducted across the country\n-\tExecution of outdoor branding activities by liaising with third party marketing agencies. I supervised over 50 wall branding projects across the country since 2014.\n-\tExecution of above the line marketing campaigns \n-\tSuccessful management of marketing campaigns and partnerships for the HORECA department \n-\tDevelopment and execution of digital marketing  campaigns in line with the existing events and promotions. \n-\tManagement of vendors\/suppliers and constantly negotiating for good prices and quality work e.g. brand agencies, printing agencies etc. \n-\tManagement of the marketing collateral inventory \n-\tManagement of marketing budgets\n-      PR Events planning and execution \n-      Design Suite management\n-      Execution of product research projects e.g. pilot projects of new products and competitor activities \n","startDate":"Jul 2014 ","endDate":"Jul 2016"},{"company":"Waridi Events LTD&#44; Nairobi","summary":"Marketing Coordinator","desc":"I was responsible for the planning and execution of marketing activities in the company. Which included implementing Waridi Event&#39;s marketing strategy, generating brand awareness, conducting market research, managing the internal marketing budget, generating leads, managing marketing campaigns and creating customer retention strategies.\n\nResponsibilities\n- Managing the company&#39;s brand in terms of communication materials, brand materials &amp; merchandise.\n- Building event services awareness by creating and executing BTL campaigns.\n- Identifying prospects and developing marketing and sales strategies to secure new business which included ;  targeted campaign strategies , competitive analysis, coordination of pitches, presentations and proposals as well as follow-up activities.\n- Creation and development of standardized sales pitch, script and presentation.\n- Creating brand awareness  \n- Conducting market research through SWOT analysis \n- Identifying a niche and analyzing the clients&#39; needs \n- Preparation of quarterly marketing budgets and measuring ROI`s of marketing campaigns.\n- Developing clearly defined KPI’s to measure the results of the implemented marketing activities\n- Generation client feedback mechanisms.\n- Formulation and implementation of customer retention strategies","startDate":"Dec 2013 ","endDate":"Jun 2014"}],"education":[{"institution":"Chartered Institute of Marketing","studyType":"CERTIFICATE IN CIM&#44; Marketing","startDate":"2014 ","endDate":"2014"},{"institution":"Strathmore University","studyType":"Bachelor of Science in Business Information Technology","startDate":"2009 ","endDate":"2013"}],"skills":["Research","Market Research","Analysis","HTML","Customer Insight","MySQL","Data Analysis","Microsoft Office","Marketing","Management","Marketing Strategy","Social Media Marketing","Microsoft Excel","Customer Service","Social Media","Teamwork","Strategic Planning","Event Management","Business Strategy","Business Analysis"],"category":{"Travel Transportation":{"point":2,"skills":[[{"work_pos":{"company":"MiDCOM Group, Nairobi , Kenya","summary":"Assistant Trade Marketing Manager"},"point":2}],[{"work_pos":{"company":"MiDCOM Group, Nairobi , Kenya","summary":"Assistant Trade Marketing Manager"},"point":2},{"work_pos":{"company":"Waridi Events LTD, Nairobi","summary":"Marketing Coordinator"},"point":1}]]},"Places":{"point":2,"skills":[[{"work_pos":{"company":"MiDCOM Group, Nairobi , Kenya","summary":"Assistant Trade Marketing Manager"},"point":2}],[{"work_pos":{"company":"MiDCOM Group, Nairobi , Kenya","summary":"Assistant Trade Marketing Manager"},"point":2},{"work_pos":{"company":"Waridi Events LTD, Nairobi","summary":"Marketing Coordinator"},"point":2}],[{"work_pos":{"company":"MiDCOM Group, Nairobi , Kenya","summary":"Assistant Trade Marketing Manager"},"point":2},{"work_pos":{"company":"Waridi Events LTD, Nairobi","summary":"Marketing Coordinator"},"point":2},{"work_pos":{"institution":"Chartered Institute of Marketing","studyType":"CERTIFICATE IN CIM, Marketing"},"point":1}],[{"work_pos":{"company":"MiDCOM Group, Nairobi , Kenya","summary":"Assistant Trade Marketing Manager"},"point":2},{"work_pos":{"company":"Waridi Events LTD, Nairobi","summary":"Marketing Coordinator"},"point":2},{"work_pos":{"institution":"Chartered Institute of Marketing","studyType":"CERTIFICATE IN CIM, Marketing"},"point":1},{"work_pos":{"institution":"Strathmore University","studyType":"Bachelor of Science in Business Information Technology"},"point":1}],{"skill":"Teamwork","point":1}]},"Shopping":{"point":2,"skills":[{"skill":"Teamwork","point":1}]}}}