{"basics":{"name":"Gary Alibozek","label":"* GE-nuinely appreciate bolstering a compelling leader of precision CNC machining , product development and Environmental Health and Safety passion within (5) exciting GE Division TEAMS  ; beginning with very comprehensive conventional and numerical control machining training from McCann Technical School&#39;s Machining Technology Program of the 1970&#39;s, CNC programming , (12) GE Precision Machining Certifications and CNC training of Berkshire Community College&#39;s Engineering Technology Program and GE- Naval Ordnance&#39;s\/GE-Plastics Corporate Technical Career Training Centers, shortly thereafter throughout the next decade-\n\n *T-then able to combine unique conventional machining skills gained by advancing into CNC final machining of the United States Navy&#39;s Mark VI Nuclear Missile Guidance System TEAM within the 1980&#39;s timeframe for GE- Naval Ordnance.\n *E-even though this GE Defense Division was not to be part of GE&#39;s vision of the 1990&#39;s, marking the end of the cold war, it enriched me to advance into product development within our GE-Plastics World Headquarters TEAM, also situated in Pittsfield,Ma \n *A-along came the new millenium , coinciding with two monumental changes within General Electric and the US; the departure of longtime CEO John Welch, as well as the escalating importance of the new &quot; Green World Initiative &quot;, ushered in by newly tabbed GE CEO Jeff Immelt. Consequently, GE -Plastics\/Specialty Materials didn&#39;t fit into that plan. A winning challenge , as I found myself once again formatting advancing machining skills within GE&#39;s fine Aviation Division TEAM of Clarendon, VT.\n*M-many great GE Division TEAMS, one very openminded precision machinist with a confident attitude of maintaining the TEAM spirit for a bright future!\n \n &quot; The whole is greater than the sum of its parts&quot; ; Aristotle-\n &quot; The world needs dreamers and the world needs doers. But above all, the world needs dreamers who do&quot;; Sarah Ban Breathnach-\n &quot; Failure is impossible&quot; ; Susan B. Anthony-","profile":"https:\/\/www.linkedin.com\/in\/gary-alibozek-2a0a8572\/"},"work":[{"company":"GE Aviation&#44; Clarendon, Vermont- Main Plant II","summary":"GEnx Engine Team \/ CNC- Robotic Machining-","desc":"~Proprietary Machining of both commercial and military GE Brand Aircraft Engine turbine airfoils, as well as power generation turbines. CNC machining,  robotic machining, final inspection , as well as conventional machining applications. \nAdvanced knowledge of airfoil design, dimensional characteristics and associated analysis of optimum strength of each turbine airfoil stage; Colonial Broach, Fadal VMC, Mazak VMC, Haas VMC, Okuma VMC, Okuma Lathes, Chiron VMC and several various  CMM machines, as well as a host of other machine tools.\n- Also an active member of GE&#39;s Green Mountain EH &amp; S TEAM, primary focus is on &quot;Energy Conservation subTEAM&quot;​ - 2009-2013.\n* Certifications:NC Machining-1, NC Machining-2, and  Precision Broach currently active, while achieving\/advancing a total of (12) exciting CNC and conventional Machining Certifications in five GE Divisions of increasing complexity. Simultaneously in March 2004, (due to GE Plastics impending sale to SABIC International) interviewed at sister Hooksett GE Aviation plant , culminating in also being selected , complete with written offer letter for an L-21 Advanced Machining 5-axis sector precision machining  leader , however, selflessly opted to accept Rutland machining position, due to family reasons. * Each and every GE Certification was the result of a previous earned  upgrade, while I had never not been able to achieve  certification of any upgrade.\n* Member of GE&#39;s  Quarter Century Club: May 23, 2012-","startDate":"Jul 1984 ","endDate":" Present "},{"company":"Historic Susan B. Anthony Farm \/ Hilltown Biodiesel, LLC.&#44; Berkshire County, Ma.","summary":"Advisory Board Member\/Chairman- Adams Agricultural Commission","desc":"~Inspired by a $125,000 government grant of the Department of Energy, Hilltown Biodiesel is a group of Western Massachusetts growers developing oilseed crops into biodiesel fuel. As a TEAM, we are able to grow oil-seed crops, further develop, precisely maintain and efficiently operate the first biodiesel processing unit ever in the U.S. that is of a mobile design, while also equipped with a methanol recovery system.\n Advisory board member \/ Susan B. Anthony Farm; dedicated family TEAM member of all-natural certified grassfed Angus beef production. Collaboratively, our family and ancestors had purchased and proudly operated Susan B. Anthony&#39;s  birth farm for the past 100 yrs.","startDate":"Jan 1990 ","endDate":" Present "},{"company":"GE-Plastics Research &amp; Development World Headquarters&#44; Pittsfield, Massachusetts","summary":"Non-exempt salary\/Development Technician-Grade 11","desc":"[ Upgrade awarded after interview and selection process of 410 internal GE applicants]~TEAM World Headquarters of GE- Plastics ; product development and toolroom maintenance machining of research and development plant components. \n\n     *Certified Class &quot;A&quot;​ toolroom machinist. This was the same process development laboratory that John   &quot;Jack&quot; Welch worked in for many years as a young Development Engineer prior to becoming the historic General Electric CEO he&#39;d eventually become.\n* Selected for specialized Corporate training at GE-Plastics Marketing World Training Facility, &quot;​ Modern Injection Molding&quot; ; Atlanta, Ga.( 14 days)\n* Please refer to annual 360 MANAGER performance appraisal review documents.\n* I have been able to earn (8) different GE Management awards in the first four GE Divisions I have worked in from 1984 through 2004. Each and every one of these site locations were Global Headquarters of the particular GE Division that I worked for*","startDate":"Feb 1989 ","endDate":" Present "},{"company":"GE Aerospace Division &#44; Pittsfield,Ma.","summary":"Class &quot;A&quot; Nuclear Missile Machinist\/ L-24 rate","desc":"~Final machining for the Mark VI Nuclear Missile Guidance System- Trident II Nuclear Submarine onboard weaponry, as well as executing several other US military final machining of high profile weaponry components. Earned L-24 work rate at age (23), which was then the highest hourly code level of complexity , while earning the honor of being  the youngest Class&quot;A&quot;​ Nuclear Missile Machinist ever on the Pittsfield GE Naval Ordnance Headquarters TEAM.\n~ UNIAPT CNC Programming I course.(24 weeks)\n~ UNIAPT CNC Programming II course.(24 weeks)\n~ CALMA CNC Programming \/Interactive graphics I.(25 weeks)\n~ CALMA CNC Programming\/ Interactive graphics II.(25 weeks) \n( all GE -Defense Systems Courses) \n* Received Corporate management award for being first machinist to ever operate (2) machining centers simultaneously to lead TEAM to establish competitive edge of the Nuclear Missile Machining procurement of US Navy contract bid process.\n* Received instructor management award at course completions for championing all four while \ncoming in for all afternoon classes , while also working third shift.* Additionally, completed &quot;socio-tech&quot; (26) week TEAM building course.\n- Heidenhain Machine programming.","startDate":"Jul 1984 ","endDate":" Present "},{"company":"GE-Plastics Corporate Headquarters&#44; Pittsfield,Ma.","summary":"Non-exempt salary\/Product Development Technician- Grade 11","desc":"~Product Development, toolroom maintenance machining and Environmental Health and Safety work in support of a variety of GE Engineering Thermoplastics TEAMS. Worked in same office complex of GE Plastics World Headquarters as current General Electric- CEO Jeff Immelt.\n* As part of Corporate Safety Staff, completed Massachusetts First Responders Certification six consecutive years. *Certified Class &quot;A&quot; toolroom machinist;\n Programmable Hurco VMC, Engine lathes, Bridgeport EZ Track programmable VMC, surface grinders, Colonial Broach, Zeis CMM, Brown &amp; Sharpe CMM, as well as a host of other toolroom machine tools.\n* Please refer to annual 360 MANAGER performance appraisal documents.","startDate":"Nov 1993 ","endDate":"Apr 2004"},{"company":"Pfizer Corporation&#44; Adams, Ma.","summary":"Robotic Manufacturing Specialist","desc":"~Efficiently operate automated and robotic packaging equipment for various calcium carbonated products. Completed (20) week TEAMing course. This position resulted from elimination of all Research &amp; Development from GE-Plastics Corporate Headquarters, consequently, eliminating 142 Product Development Technicians from Pittsfield site.","startDate":"Dec 1992 ","endDate":"Nov 1993"},{"company":"Harnischfeger Corporation consequently aquired (Beloit Jones Corp.)&#44; Dalton, Massachusetts.","summary":"Precision CNC Machinist","desc":"First co-op student ever selected for pilot work study program with McCann Technical Machining Technology program. Operation of CNC and conventional Machining Centers for final machining of paper and injection molding machinery components. Received at 95% grade.","startDate":"Sep 1979 ","endDate":"Mar 1980"},{"company":"Alibozek&#39;s Tophet Brook Farm&#44; Adams, Ma.","summary":"Dairy Technician","desc":"Family operated dairy and beef farming operation comprised of 500 acres of farm property in Cheshire, N. Adams, and Adams , Ma. since the turn of the century. Successful winner of several somatic cell count quality awards for milk quality and milk production cleanliness- by FDA. Several occasions per year I was depended  on to operate entire farm for extended periods to facilitate senior family members vacation time. This ranged from a couple days to over two weeks.\n\n*Maintenance machinist; Bridgeport machining center, surface grinder, bench lathe, mig welding and associated tooling.\n*Massachusetts State Certified artificial insemination technician for (10) years to increase dairy herd genetics.\n* This was by far the most powerful training demonstration of TEAMing of all (5) structured TEAM training initiatives of my life.","startDate":"Jan 1972 ","endDate":"Jan 1979"}],"education":[{"institution":"Hardinge Tool Corporate Training Center- Elmira,NY","studyType":"EZ Track CNC Programming&#44; CNC Programming","startDate":"2004 ","endDate":"2004"},{"institution":"MCLA","studyType":"Business Administration and Management, General","startDate":"2004 ","endDate":"2004"},{"institution":"Berkshire Community College","studyType":"Engineering Technology, General","startDate":"1985 ","endDate":"1987"},{"institution":"Charles H McCann Technical School","studyType":"Diploma&#44; Machine Tool Technology \/ Machinist","startDate":"1977 ","endDate":"1981"}],"skills":["Product Development","Machining","Training","Alternative Fuels","Inspection","Materials","Military","Six Sigma","Cnc","Composites","Agronomy","Breeding\/raising of top quality Angus Beef.","CNC and conventional Machinist.","Mazak","Bostomatic","Hurco","Fanuc","Giddings &amp; Lewis","DeVlieg","Haas","Okuma","Fadal","Wotan","Csip","Brown &amp; Sharpe","Jig Bore","CALMA","CNC Programming","Aerospace","Mori Seiki","Root Cause Analysis","CNC","Engineering","Manufacturing","Cross-functional Team Leadership","Lean Manufacturing","Management","Continuous Improvement","R&amp;D","Process Improvement","Team Building","Injection Molding","Process Engineering","Public Speaking","Leadership","Business Process Improvement","Computer Numerical Control (CNC)","Research and Development (R&amp;D)","Aircraft Engines"],"category":{"Technology":{"point":2,"skills":[[{"work_pos":{"company":"GE Aviation, Clarendon, Vermont- Main Plant II","summary":"GEnx Engine Team \/ CNC- Robotic Machining-"},"point":2}],[{"work_pos":{"company":"GE Aviation, Clarendon, Vermont- Main Plant II","summary":"GEnx Engine Team \/ CNC- Robotic Machining-"},"point":2},{"work_pos":{"company":"GE-Plastics Research & Development World Headquarters, Pittsfield, Massachusetts","summary":"Non-exempt salary\/Development Technician-Grade 11"},"point":2}],[{"work_pos":{"company":"GE Aviation, Clarendon, Vermont- Main Plant II","summary":"GEnx Engine Team \/ CNC- Robotic Machining-"},"point":2},{"work_pos":{"company":"GE-Plastics Research & Development World Headquarters, Pittsfield, Massachusetts","summary":"Non-exempt salary\/Development Technician-Grade 11"},"point":2},{"work_pos":{"company":"Pfizer Corporation, Adams, Ma.","summary":"Robotic Manufacturing Specialist"},"point":2}],[{"work_pos":{"company":"GE Aviation, Clarendon, Vermont- Main Plant II","summary":"GEnx Engine Team \/ CNC- Robotic Machining-"},"point":2},{"work_pos":{"company":"GE-Plastics Research & Development World Headquarters, Pittsfield, Massachusetts","summary":"Non-exempt salary\/Development Technician-Grade 11"},"point":2},{"work_pos":{"company":"Pfizer Corporation, Adams, Ma.","summary":"Robotic Manufacturing Specialist"},"point":2},{"work_pos":{"institution":"Berkshire Community College","studyType":"Engineering Technology, General"},"point":2}],[{"work_pos":{"company":"GE Aviation, Clarendon, Vermont- Main Plant II","summary":"GEnx Engine Team \/ CNC- Robotic Machining-"},"point":2},{"work_pos":{"company":"GE-Plastics Research & Development World Headquarters, Pittsfield, Massachusetts","summary":"Non-exempt salary\/Development Technician-Grade 11"},"point":2},{"work_pos":{"company":"Pfizer Corporation, Adams, Ma.","summary":"Robotic Manufacturing Specialist"},"point":2},{"work_pos":{"institution":"Berkshire Community College","studyType":"Engineering Technology, General"},"point":2},{"work_pos":{"institution":"Charles H McCann Technical School","studyType":"Diploma, Machine Tool Technology \/ Machinist"},"point":2}]]},"Health":{"point":2,"skills":[[{"work_pos":{"company":"GE Aviation, Clarendon, Vermont- Main Plant II","summary":"GEnx Engine Team \/ CNC- Robotic Machining-"},"point":2}]]},"Travel Transportation":{"point":3,"skills":[[{"work_pos":{"company":"GE Aviation, Clarendon, Vermont- Main Plant II","summary":"GEnx Engine Team \/ CNC- Robotic Machining-"},"point":3}],[{"work_pos":{"company":"GE Aviation, Clarendon, Vermont- Main Plant II","summary":"GEnx Engine Team \/ CNC- Robotic Machining-"},"point":3},{"work_pos":{"company":"Historic Susan B. Anthony Farm \/ Hilltown Biodiesel, LLC., Berkshire County, Ma.","summary":"Advisory Board Member\/Chairman- Adams Agricultural Commission"},"point":3}]]},"Places":{"point":4,"skills":[[{"work_pos":{"company":"GE Aviation, Clarendon, Vermont- Main Plant II","summary":"GEnx Engine Team \/ CNC- Robotic Machining-"},"point":4}],[{"work_pos":{"company":"GE Aviation, Clarendon, Vermont- Main Plant II","summary":"GEnx Engine Team \/ CNC- Robotic Machining-"},"point":4},{"work_pos":{"company":"Historic Susan B. Anthony Farm \/ Hilltown Biodiesel, LLC., Berkshire County, Ma.","summary":"Advisory Board Member\/Chairman- Adams Agricultural Commission"},"point":3}]]}}}