{"basics":{"name":"Jeremiah Kinyua K.","label":"A mature professional individual with hopeful progressive career with over 10 years of experience in corporate security management, Possessing good communication skills in English and Swahili which he is able to exercise at all levels. I am able to provide Risk and Security information to all areas of the corporate while ensuring that all organization information is accurate. Having ability to drive out insecurities through process improvement as well as assisting in the upkeep and development of security systems besides office procedures. I am also able to provide timely, efficient administrative support to office managers and colleagues. I desire to work within a challenging and rewarding environment, which will give me an opportunity to utilize my acquired skills, apply my academic knowledge that leads to both personal and organizational growth to international standards. Am a hardworking, responsible, confident, and self-motivated man, a team player who can either work under minimal or independently with no supervision. I like negotiations, control, positive change and public speaking. I possess personal and professional integrity, open to entrepreneurial thinking, and develop transparency and openness for strategic change and new possibilities.I am talented on managing numerous priorities and encountering right targets without compromising excellence,though always readily to adapt to transformation. My legal wife Christine and I have 3 children.\n\nOthers have described me as a gifted diplomat leader, Jeremiah the Great! The principled fanny man, this depends on their mode of thinking.","profile":"https:\/\/www.linkedin.com\/in\/jeremiah-kinyua-k-3126a982\/"},"work":[{"company":"Salama Fikira&#44; Nairobi Kenya","summary":"Regional Security Coordination Centre Operator at SALAMA FIKIRA International:","desc":"\tWorking as Regional Security Coordination Centre Operator with Salama Fikira International based in Nairobi metropolis.\n Responsibilities involved:-\n\t(A) Ensuring that accurate records are kept and all calls and CCTV cameras sensitive footage              reports are logged in, data stored for generation of reports for investigation by management.\n\n\t(B) Car tracking: Effectively monitoring signals from client vehicles,using Sicurotrack, Telematics , MS Track, Oysta and ZON control technology vehicle tracking systems.\n\tIncident management: Dealing with all incidents and emergencies like Accidents, Theft\/fraud, Carjacking within laid down response and escalation procedures.\n\n\t(C) Office administration: Dealing with all telephone calls and radio messages professionally and in accordance with laid down procedures.\n\n\t(D) Guard Supervision i.e. over the camera severance making sure the premise is securely intact, all guards to be vigilant at their respective assignment.\n\n\t(E) Maintaining electronic logs \/ record of insecurity events in the Region.\n\n\t(F) Efficiently monitoring CCTV images via internet and other ICT apparatuses &amp; footage reviewing as per procedure.\n\t(G) Access control: Effectively monitoring stationary assets using Bio metric access control  technology, processing and activation of access cards.\n","startDate":"Feb 2015 ","endDate":" Present "},{"company":"Safaricom&#44; Safaricom Head Quarters Nairobi Metropolis","summary":"RISK_Controller\/C.R.S at Safaricom Headquarters:","desc":"\tWorked as a Security Risk Controller with CRS- Risk Management Services Ltd.\n Based at Safaricom Head Quarters. Duties include:\n\n1.\tMonitor access control systems, CCTV camera review and electronic surveillance systems, intrusion and fire alarms at Safaricom company buildings and (BTS) Boaster Transmitter Stations.\n\n2.\tIncident management e.g. Accidents, Theft, Carjacking.\n\n3.\tOffice administration i.e. handling calls, preparing daily reports.\n\n4.\tSecurity Guard Supervision.\n\n5.\tClient journey management.","startDate":"Apr 2013 ","endDate":"Feb 2015"},{"company":"British American Tobacco&#44; Bob Morgan Services:","summary":"Security Officer\/BM at B.A.T Kenya, Likoni Road Nairobi:","desc":"Based at British American Tobacco, duties included:-\n\n1.Access and Exit control.\n\n2.Office administration i.e. handling phone calls and Security radio communication.\n\n3.Guard Supervision.","startDate":"Sep 2011 ","endDate":"Apr 2013"},{"company":"KK Security (Kenya) Ltd&#44; Mtwapa","summary":"Rapid Response Team Crew Commander KENYA KAZI Mombasa:","desc":"1.Radio communication to and from the control room.\n\n2. Security guard deployment and supervention.\n\n3.Conducting security vehicle patrols and keeping sentry at specified locations.\n\n4. Rapidly attending to client alarm activation and other security related emergencies.\n\n5.Restraining and ferrying criminals to a respective police station.\n","startDate":"Apr 2002 ","endDate":"Dec 2008"}],"education":[{"institution":"PAN AFRICAN CHRISTIAN UNIVERSITY","studyType":"Transformation Church Leaders Development Program.","startDate":"2009 ","endDate":"2011"},{"institution":"NGERU BOYS","studyType":"","startDate":"1997 ","endDate":"1999"},{"institution":"NGERU BOYS HIGHSCHOOL","studyType":"KCEC CERTIFICATE","startDate":"1996 ","endDate":"1999"}],"skills":["Operational Risk Management","Risk Assessment","Security","Security Operations","Private Investigations","Management","Security Management","Surveillance","Security Audits","Counterterrorism","Crisis Management","Access Control","Corporate Security","Security Training","CCTV","Executive Protection","Risk Management","Emergency Management","Leadership","Microsoft Office","Team Leadership","Customer Service","Fraud","Research","Training","Strategic Planning","Close Protection","Personal Security","Microsoft Excel","Physical Security","Closed-Circuit Television (CCTV)"],"category":{"Technology":{"point":1,"skills":[{"skill":"Security Operations","point":1},{"skill":"Microsoft Office","point":1},{"skill":"Microsoft Excel","point":1}]},"Home Decorations":{"point":1,"skills":[{"skill":"CCTV","point":1}]},"Travel Transportation":{"point":2,"skills":[[],[],[],[{"work_pos":{"company":"KK Security (Kenya) Ltd, Mtwapa","summary":"Rapid Response Team Crew Commander KENYA KAZI Mombasa:"},"point":2}],[{"work_pos":{"company":"KK Security (Kenya) Ltd, Mtwapa","summary":"Rapid Response Team Crew Commander KENYA KAZI Mombasa:"},"point":2},{"work_pos":{"institution":"PAN AFRICAN CHRISTIAN UNIVERSITY","studyType":"Transformation Church Leaders Development Program."},"point":2}]]},"Places":{"point":2,"skills":[[],[],[],[{"work_pos":{"company":"KK Security (Kenya) Ltd, Mtwapa","summary":"Rapid Response Team Crew Commander KENYA KAZI Mombasa:"},"point":2}],[{"work_pos":{"company":"KK Security (Kenya) Ltd, Mtwapa","summary":"Rapid Response Team Crew Commander KENYA KAZI Mombasa:"},"point":2},{"work_pos":{"institution":"PAN AFRICAN CHRISTIAN UNIVERSITY","studyType":"Transformation Church Leaders Development Program."},"point":2}]]}}}