{"basics":{"name":"Mhasibu SACCO Society Ltd","label":"We aspire to be thee SACCO of excellence that provides quality and superior services to its members and be the best managed SACCO in the East and Central Africa.\nMission:To encourage and mobilize savings from members and thus economically empower the members by availing low cost funds to augment their financial needs, be in control of their personal development, and attain their financial independence.\nObjectives :\nExpand and raise capital\nAttract, develop, and retain the best human resources\nDevelop appropriate infrastructure\nStreamline loan processing procedures\nIncrease capital and investments in related organizations.\nWebsite : http:\/\/mhasibusacco.com\/\nFacebook : https:\/\/www.facebook.com\/Mhasibu\/\nTwitter : https:\/\/twitter.com\/mhasibuofficial","profile":"https:\/\/www.linkedin.com\/in\/mhasibu-sacco-society-ltd-364787148\/"},"work":[{"company":"Mhasibu SACCO Society Ltd&#44; Nairobi - Kenya","summary":"Financial Services","desc":"Heritage of the Sacco \nThe registration of Mhasibu SACCO 30 years ago was spearheaded by the Institute of Certified Public Accountants of Kenya (ICPAK) which was driven by the wish to provide Savings and Credit facilities to its members. \nMhasibu SACCO whose name means ‘accountant’ in Swahili currently serves members engaged in the accounting profession to include inter alia: qualified accountants yet to be members of ICPAK, students of KASNEB &amp; ACCA, employees of institutions that offer training in accounts as well as the spouses and children of existing members.\nFrom a paltry 37 members in 1986, the SACCO now boasts of a membership of about 18,000 members and has elaborate marketing plans to maintain the growth trend going by the high number of accounting students in the country. The SACCOs market potential is estimated to be over 500,000 members and the SACCO intends to capture at least 2% of this by 2015.\nOur Mission : To mobilize Savings and Economically empower members to attain financial independence\nOur Vision : To be a Sacco of Excellence among the best managed in the world.\n Core Values ;  \n 1. Excellence\n2. Integrity\n3. Innovation\n4. Teamwork\n5. Fairness and Social Care","startDate":"Apr 1986 ","endDate":" Present "}],"education":[],"skills":["Strategic Planning"],"category":{"Law\/Tax":{"point":2,"skills":[[{"work_pos":{"company":"Mhasibu SACCO Society Ltd, Nairobi - Kenya","summary":"Financial Services"},"point":2}]]},"Travel Transportation":{"point":2,"skills":[[{"work_pos":{"company":"Mhasibu SACCO Society Ltd, Nairobi - Kenya","summary":"Financial Services"},"point":2}]]},"Places":{"point":2,"skills":[[{"work_pos":{"company":"Mhasibu SACCO Society Ltd, Nairobi - Kenya","summary":"Financial Services"},"point":2}]]}}}