{"basics":{"name":"Navigos Search","label":"Navigos Search is the leading provider of executive search services in Vietnam. Our biggest strengths are our experienced and qualified consultants and our comprehensive database. Our mission is to support people and companies achieve their professional dreams and organizational aspirations. To summarize our offering, we assist individuals get the jobs to which they are best suited, and we assist our clients bring the most suitable candidates on board.\n\nWe have recently become a part of the Japan based recruitment multinational company, en World. This merger has taken Navigos Search to a new position of strength as we inherit en World’s cutting edge systems and processes, exposing our clients to a higher level of service. We can also expand our service base to all en world locations, with offices in Japan, Hong Kong, Singapore, Korea, Australia and Thailand.","profile":"https:\/\/www.linkedin.com\/in\/navigossearch\/"},"work":[{"company":"Navigos Search&#44; Unit 702, 7th Floor, Sunwah Tower, 115 Nguyễn Huệ, District 1, HCMC","summary":"Company","desc":"Our approach: \n\nExploration\nNavigos Search invests time, expertise and effort in collaborating with clients to get a clear understanding of their core values, business strategy and corporate culture. We firmly believe that these factors are of great importance in getting a well rounded picture of any recruitment need.\n\nSelection\nNavigos Search has access to an extensive database of senior executives and an ever expanding network of high-profile candidates. We have a structured selection procedure. All candidates are interviewed face-to-face before being shortlisted for Clients. The interview process is consistently rigorous and investigatory, thoroughly checking if each candidate - CAN do the job; WILL do the job; and will FIT into the client organization.\n\nSupport\nNavigos Search assesses each candidate on the basis of multiple criteria. Once shortlisted, all candidates are put through a comprehensive reference check. This ensures that we provide a thoroughly investigated description of each candidate. In all cases, Navigos Search acts as an ambassador of the client. We make sure that we assess the motivations of each candidate even while trying to stimulate their interest. We are an impartial and trusted advisor and are objective in all assessments of the candidates. We also mediate in negotiations and collaborate with clients right uptil closure with the final candidate of choice. Our partnership continues even after the candidate joins the client and we stay in touch with both to ensure that levels of interest are reciprocated and maintained.","startDate":"2003 ","endDate":" Present "}],"education":[],"skills":["Technical Recruiting","Talent Management","Recruiting","HR Consulting","Strategic Planning","Hiring","Management","Interviewing Skills","Teamwork","Executive Search","Search","Interviews","Team Building","Talent Acquisition","Customer Service","English","Negotiation","Time Management","Team Leadership","Human Resources","Team Management","Leadership","CRM","Strategy","Business Development","Project Planning","Performance Management","Social Networking","Organizational Development","Market Research","Sourcing","Training","Employee Relations","Employer Branding","Business Planning","Coaching","Personnel Management","Employee Training","Recruitment Advertising","Business Strategy","Training Delivery","Leadership Development","Employee Engagement","Deferred Compensation","Workforce Planning","HR Policies","Succession Planning","Screening","Performance Appraisal","Recruitments"],"category":{"Law\/Tax":{"point":2,"skills":[{"skill":"HR Policies","point":2}]},"Careers":{"point":2,"skills":[{"skill":"Technical Recruiting","point":2},{"skill":"Recruiting","point":2},{"skill":"HR Consulting","point":2},{"skill":"Hiring","point":2},{"skill":"Interviewing Skills","point":2}]},"Travel Transportation":{"point":2,"skills":[{"skill":"Technical Recruiting","point":3},{"skill":"Recruiting","point":3},{"skill":"Teamwork","point":2},{"skill":"Search","point":2},{"skill":"Interviews","point":2},{"skill":"Team Building","point":2},{"skill":"Customer Service","point":2},{"skill":"Negotiation","point":2},{"skill":"Business Development","point":2},{"skill":"Market Research","point":2}]},"Places":{"point":2,"skills":[{"skill":"Technical Recruiting","point":3},{"skill":"Recruiting","point":3},{"skill":"Teamwork","point":2},{"skill":"Search","point":2},{"skill":"Interviews","point":2},{"skill":"Team Building","point":2},{"skill":"Customer Service","point":2},{"skill":"Negotiation","point":2},{"skill":"Business Development","point":2},{"skill":"Market Research","point":2}]},"Shopping":{"point":1,"skills":[{"skill":"Search","point":1}]}}}