{"basics":{"name":"Nicholas Stuart","label":"Have had a varied background in both work and experience in Canada and overseas.  Interests are tied to new technologies adaptabliity in areas never deemed possible.  Have always found alternative funding methods for projects overseas that were sent to me to asses.  In this regard worked very closely with Stan Ridely, Senior Vice President for Power at SNC-LAVALIN now retired. \n# Introduced the Cyrax 3D laser scanning and Modeling technology on the Shell Scotford upgrader refinery project in 1999 through networks in Flour Daniel and Colt Engineering and partner firm Pacific Surveys of Medford, Oregon.\n* Was asked by Dow Chemical, Midland Michigan  to work with Dr. Charles Kempen to promote the use of his patented mechanically coupled fibre composite high pressure pipe for the pipeline industry in Canada and overseas.  Stiff battle against conventional thinking.  Numerous board room presentations, Senior management and  engineers on board as a cost saving method but strong dissent from vested interests.  Went overseas to China where pipe successfully installed in Chinese gas field.\nLong time business associate Minh ( Michael ) Hai of MCR Trading International Company and TSI teamed up at request of Minister of Science of the Government of Vietnam to review the operations of the Cao Son and Nui Beo Anthracite coal mines of VINACOAL the Vietnam National Coal Corporation at Ha Long Bay.  Approached networks at UMA Engineering to participate in an assesment review through Marston and Marston of St Louis, Missouri.   I had strong support and personal contact with Madame Dinh Thi Minh Huyen, Ambassador Extrordinary and Plentipotentiary Socialist Republic of Vietnam-Ottawa, Canada.\n*Worked in conjunction with Global Assets Management to facilitate sustainable forest harvesting project in East &amp; West Sepik Provinces of Papua New Guinea with Peoples Republic of China.  TSI recommended a biomass carbon emissions trading program be initiated through Chicago Board of Trade.  \n+","profile":"https:\/\/www.linkedin.com\/in\/nicholas-stuart-3b9600a\/"},"work":[{"company":"Transworld Strategies, Inc.&#44; Edmonton","summary":"President","desc":"Took over company from partners in 1995.   The initial group had developed a B2B project in 1993&gt;1995 ( GLOBEX )which was well received but lacked critical funding and the necessary technology was not available at the time to implement the offshore telecom hub components tied to the air cargo logistics.   After takeover concentrated on new business development in Asia with long time business associate MCR Trading International company and with Admiral Zumwalt &amp; Consultants on projects that required out of the box thinking.   Company&#39;s primary focus was  providing innovative solutions through new technologies and alternative funding to problems on a project specific basis.  Many projects required multi tiered collaboration of funding, engineering, science and in many cases legislative backing of respective foreign governments.\n","startDate":"Oct 1995 ","endDate":"Apr 2011"}],"education":[{"institution":"University of Alberta","studyType":"Bachelor&#39;s of Science&#44; Geology\/Earth Science, General","startDate":"1978 ","endDate":"1985"}],"skills":["Team Building","Program Management","Fundraising","Non-profits","Strategic Planning","Live by a strong creed of &quot;Never Give In Never Give Up&quot;","Have strong people skills, see the adaptability of technologies to new uses.","Have introduced technologies into play on major projects sites.","Have ability to bring teams together to coordinate projects","Have ease of communications to interrelate between field and corporate heads.","Field experienced faciltator and project coordinator","Planning organization and strategic development","innovative and resourceful capable of finding solutions","technical writing skills, proposals, patents, conceptual planning","Self motivated organized problem solver adapt at multi tasking","Skilled proactive communicator that inspires team effort","Can visualize projects in a 3D fomat, cause and effect.","Public Speaking","Leadership","Policy","DoD","Leadership Development","New Business Development","Operations Management","Team Leadership","Government","Project Management","Research","Nonprofits","U.S. Department of Defense","Business Development","Customer Service","Nonprofit Organizations"],"category":{"Technology":{"point":1,"skills":[{"skill":"Have introduced technologies into play on major projects sites.","point":1},{"skill":"Can visualize projects in a 3D fomat, cause and effect.","point":1}]},"Law\/Tax":{"point":1,"skills":[{"skill":"Policy","point":1}]},"Travel Transportation":{"point":2,"skills":[[{"work_pos":{"company":"Transworld Strategies, Inc., Edmonton","summary":"President"},"point":2}],{"skill":"Team Building","point":2},{"skill":"New Business Development","point":2},{"skill":"Research","point":2},{"skill":"Customer Service","point":2}]},"Places":{"point":2,"skills":[[{"work_pos":{"company":"Transworld Strategies, Inc., Edmonton","summary":"President"},"point":2}],{"skill":"Team Building","point":2},{"skill":"New Business Development","point":2},{"skill":"Government","point":2},{"skill":"Research","point":2},{"skill":"Customer Service","point":2}]}}}